Autodesk.Revit.DB.DefaultDivideSettings.SetDistance(Autodesk.Revit.DB.UVGridlineType,System.Double)
Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
This method is obsolete in Revit 2015. Use setSurfaceDistance instead.
gridlines:
U-gridlines or V-gridlines.
distance:
A default distance for a layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distance must be positive.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.DefaultDivideSettings.GetDistance(Autodesk.Revit.DB.UVGridlineType)
Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
This method is obsolete in Revit 2015. Use getSurfaceDistance instead.
gridlines:
U-gridlines or V-gridlines.
Returns:
The default distance for the layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.DefaultDivideSettings.SetNumber(Autodesk.Revit.DB.UVGridlineType,System.Int32)
Sets the default Divided Surface number for a fixed number layout for U or V gridlines.
This method is obsolete in Revit 2015. Use setSurfaceNumber instead.
gridlines:
U-gridlines or V-gridlines.
number:
A default number for a fixed number layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for number is not positive.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.DefaultDivideSettings.GetNumber(Autodesk.Revit.DB.UVGridlineType)
Gets the default Divided Surface number for a fixed number layout for U or V gridlines.
This method is obsolete in Revit 2015. Use getSurfaceNumber instead.
gridlines:
U-gridlines or V-gridlines.
Returns:
The default number for a fixed number layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.DefaultDivideSettings.SetLayout(Autodesk.Revit.DB.UVGridlineType,Autodesk.Revit.DB.SpacingRuleLayout)
Sets the default Divided Surface layout for U or V gridlines.
This method is obsolete in Revit 2015. Use setSurfaceLayout instead.
gridlines:
U-gridlines or V-gridlines.
layout:
A layout spacing rule.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.DefaultDivideSettings.GetLayout(Autodesk.Revit.DB.UVGridlineType)
Gets the default Divided Surface layout for U or V gridlines.
This method is obsolete in Revit 2015. Use getSurfaceLayout instead.
gridlines:
U-gridlines or V-gridlines.
Returns:
The layout spacing rule.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014